driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/REpeatUntilSingleTest4/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rep="http://localhost/RepeatUntilBPEL/RepeatUntilSingle">
  <soapenv:Body>
    <rep:part1>TestRptSingle</rep:part1>
    <rep:part2>2</rep:part2>
  </soapenv:Body>
</soapenv:Envelope>